copsterr/bedOS_embedded/Esp32OS.cpp
#include "Esp32OS.h"
#include "Esp32OSConfig.h"
#include "LowLevelLibrary.h"
#include "EEPROMConfig.h"
#include <WiFi.h>
#include <WiFiUdp.h>
#include <PubSubClient.h>
#include "ReducedMCommand.h"
#include "Arduino.h"
//M Command Index
char commandIndex[] = "M Command Index \n\r\
M0:Echo \n\r\
M1:Reboot \n\r\
M100:Report All Parameter, use P1 to clear all parameter \n\r\
M101:Set Serial Baudrate \n\r\
M102: Set WIFI SSID with String \n\r\
M103 Set WIFI Password with String \n\r\
M104: Set MQTT Server Name with String \n\r\
M105: Set MQTT Server Port with P \n\r\
M106: Set MQTT Username with String \n\r\
M107: Set MQTT Password with String \n\r\
M108: Set MQTT Client Name with String \n\r\
M109: Set MQTT Tx Topic with String \n\r\
M110: Set MQTT Rx Topic with String \n\r\
M201: Set Strain Gauge Low Pass Filter Time Constant with S, optional P \n\r\
M202: Set Strain Gauge High Pass Filter Time Constant with S, optional P \n\r";

char externalCommandIndex[] __attribute__((weak)) = "External Command Index not available \n\r";

//Strain gauge filter
BandPassFilter strainGaugeFilter[4];
//Config
//Reboot
RTC_DATA_ATTR int rebootSource = -1;
bool rebootViaMqtt = false;

ReducedMCommand serialRMC(&Serial, 0);
#if USE_MQTT == 1
WiFiClient client;
PubSubClient mqtt(client);
PacketBuffer mqttWifiSerial;
ReducedMCommand mqttWifiRMC(&mqttWifiSerial, 1);
#endif

#if !defined(CONFIG_BT_ENABLED) || !defined(CONFIG_BLUEDROID_ENABLED)
#error Bluetooth is not enabled! Please run `make menuconfig` to and enable it
#endif

//Timer interrupt
hw_timer_t * timer = NULL;
portMUX_TYPE timerMux = portMUX_INITIALIZER_UNLOCKED;
SemaphoreHandle_t OSSemaphore = NULL;
volatile StateFilter buttonFilter[4];
volatile StateFilter curtainFilter[3];
volatile InputState realtimeInputState;
volatile InputState inputState;
volatile InputState runtimeInputState;
volatile OutputState hiddenOutputState;//saved old state
volatile OutputState realtimeOutputState;//manipulate this inside realtime function only
volatile OutputState outputState;//before enter user realtime calculation(), os will copy this into realtimeOutputState
volatile OutputState runtimeOutputState;//after main loop, os will copy this into realtime output state, inside run-time critical section
volatile OutputState hiddenRuntimeOutputState;//use to check if runtimeOutputState has changed by user.

volatile bool timerFlag = false;
#if USE_MQTT == 1
void mqttCallback(char* topic, byte* payload, unsigned int length) {
  #if DEBUG_MODE == 1
  Serial.println("MQTT Message received");
  Serial.print("Topic: ");
  Serial.println(topic);
  Serial.print("Payload of ");
  Serial.print(length);
  Serial.print(" bytes: ");
  for(int i = 0; i<length; i++){
    Serial.print(payload[i]);
    Serial.print(" ");
  }
  Serial.println();
  #endif
  if(String(topic) == eepromConfig.getMqttRxTopic()){
    for(int i = 0; i<length; i++){
      mqttWifiSerial.insertToReceivingBuffer((char)payload[i]);
    }
    if(payload[length-1] > 0)
      mqttWifiSerial.insertToReceivingBuffer(0);
  }
}
void onMqttWifiFlush(){
  if(mqtt.connected()){
    if(mqttWifiSerial.bufferNotSent > 0){
      mqtt.beginPublish(eepromConfig.getMqttTxTopic(), mqttWifiSerial.bufferNotSent+1, true);
      while(mqttWifiSerial.bufferNotSent > 0){
        mqtt.write(mqttWifiSerial.readFromSendingBuffer());
      }
      mqtt.write(0);
      mqtt.endPublish();
    }
  }else{
    while(mqttWifiSerial.bufferNotSent > 0){
      mqttWifiSerial.readFromSendingBuffer();
    }
  }
}
#endif
void IRAM_ATTR onTimer(){
  portENTER_CRITICAL_ISR(&timerMux);
  timerFlag = true;
  portEXIT_CRITICAL_ISR(&timerMux);
}
void onTimerFlag(){
  //do things
  //get all variable
  enterCriticalSection();
  //Copy state
  memcpy((byte*)&realtimeInputState, (byte*)&inputState, sizeof(InputState));//copy sync to realtime
  memcpy((byte*)&realtimeOutputState, (byte*)&outputState, sizeof(OutputState));//copy sync to realtime
  exitCriticalSection();
  realtimeInputState.potentiometerValue = readAnalogPotentiometer();
  realtimeInputState.accelerometerValue = readAnalogAccelerometer();
  realtimeInputState.oldButtonStatus = realtimeInputState.buttonStatus;
  realtimeInputState.buttonStatus = 0;
  for(int i = 0; i<4; i++){
    realtimeInputState.oldButtonPressed[i] = realtimeInputState.buttonPressed[i];
    realtimeInputState.buttonPressed[i] = buttonFilter[i].getFilteredState(readPushButton(i));
    realtimeInputState.buttonStatus += realtimeInputState.buttonPressed[i]? (1<<i):0;
  }
  if(realtimeInputState.buttonStatus == 0){
    realtimeInputState.readyToAcceptGesture = true;
    realtimeInputState.buttonGestureTimerCounter = 0;
    realtimeInputState.buttonGestureAutoTriggerCounter = 0;
  }else{//if buttonStatus != 0
    //Check if there is no falling
    if((realtimeInputState.oldButtonStatus & ~realtimeInputState.buttonStatus) > 0){//Some button are released before gesture event happens, ignore gesture
      realtimeInputState.readyToAcceptGesture = false;//Ignore until all buttons are released
    }
    if(realtimeInputState.readyToAcceptGesture){
      if(realtimeInputState.buttonGestureTimerCounter < WAIT_FOR_BUTTON_GESTURE){
        if(realtimeInputState.buttonStatus != realtimeInputState.oldButtonStatus){//more button is pressed
          realtimeInputState.buttonGestureTimerCounterFlag = 0;//reset flag
          realtimeInputState.buttonGestureAutoTriggerCounterFlag = 0;//reset flag
          realtimeInputState.currentGesture = realtimeInputState.buttonStatus;//set gesture
          realtimeInputState.buttonGestureTimerCounter = 0;//restart counter
          realtimeInputState.buttonGestureAutoTriggerCounter = 0;
        }else{
          realtimeInputState.buttonGestureTimerCounter += SAMPLING_TIME_US;
          if(realtimeInputState.buttonGestureTimerCounter >= WAIT_FOR_BUTTON_GESTURE){//call event
            realtimeInputState.buttonGestureTimerCounterFlag++;
          }
        }
      }else{
        realtimeInputState.buttonGestureAutoTriggerCounter += SAMPLING_TIME_US;
        if(realtimeInputState.buttonGestureAutoTriggerCounter >= BUTTON_GESTURE_LONG_PRESS_TRIGGER_PERIOD){
          realtimeInputState.buttonGestureAutoTriggerCounter -= BUTTON_GESTURE_AUTOMATIC_TRIGGER_PERIOD;
          realtimeInputState.buttonGestureAutoTriggerCounterFlag++;
        }
      }
    }
  }
  for(int i = 0; i<3; i++){
    realtimeInputState.oldCurtainState[i] = realtimeInputState.curtainState[i];
    realtimeInputState.curtainState[i] = curtainFilter[i].getFilteredState(readLightCurtain(i));
    if(realtimeInputState.curtainState[i] == realtimeInputState.oldCurtainState[i])
      realtimeInputState.realtimeCounterOfCurtain[i]++;
    else{
      realtimeInputState.realtimeCountsOfLastCurtainEvent[i] = realtimeInputState.realtimeCounterOfCurtain[i];
      realtimeInputState.realtimeCounterOfCurtain[i] = 0;
    }
    realtimeInputState.curtainRiseFlag[i] = (realtimeInputState.curtainState[i] && !realtimeInputState.oldCurtainState[i])? true:realtimeInputState.curtainRiseFlag[i];
    realtimeInputState.curtainFallFlag[i] = (!realtimeInputState.curtainState[i] && realtimeInputState.oldCurtainState[i])? true:realtimeInputState.curtainFallFlag[i];
  }
  realtimeInputState.strainGaugeReadFlag = realtimeInputState.strainGaugeReadFlag || readStrainGaugeValue((int32_t*)realtimeInputState.strainGaugeValue, STRAIN_GAUGE_READ_MODE, STRAIN_GAUGE_BYPASS);
  for(int i = 0; i<4; i++){
    realtimeInputState.strainGaugeFilteredValue[i] = strainGaugeFilter[i].filter((float)realtimeInputState.strainGaugeValue[i]);
  }
  //do other calculation
  realtimeFunction();
  //do signal pattern
  for(auto cdtIt = cdtVector.begin(); cdtIt != cdtVector.end(); cdtIt++){
    (*cdtIt)->onRealtime();
  }
  for(auto patternIt = patternVector.begin(); patternIt != patternVector.end(); patternIt++){
    (*patternIt)->realtimeRun();
  }
  //drive output
  if(realtimeOutputState.rgbLedState[0] != hiddenOutputState.rgbLedState[0]){
    hiddenOutputState.rgbLedState[0] = realtimeOutputState.rgbLedState[0];
    driveRLed(hiddenOutputState.rgbLedState[0]);
  }
  if(realtimeOutputState.rgbLedState[1] != hiddenOutputState.rgbLedState[1]){
    hiddenOutputState.rgbLedState[1] = realtimeOutputState.rgbLedState[1];
    driveGLed(hiddenOutputState.rgbLedState[1]);
  }
  if(realtimeOutputState.rgbLedState[2] != hiddenOutputState.rgbLedState[2]){
    hiddenOutputState.rgbLedState[2] = realtimeOutputState.rgbLedState[2];
    driveBLed(hiddenOutputState.rgbLedState[2]);
  }
  if(realtimeOutputState.lightLedState != hiddenOutputState.lightLedState){
    hiddenOutputState.lightLedState = realtimeOutputState.lightLedState;
    driveLightLed(hiddenOutputState.lightLedState);
  }
  if(realtimeOutputState.buzzerState != hiddenOutputState.buzzerState){
    hiddenOutputState.buzzerState = realtimeOutputState.buzzerState;
    driveBuzzer(hiddenOutputState.buzzerState);
  }
  
