copsterr/bedOS_embedded/Esp32OS.cpp
  enterCriticalSection();
  //Copy state
  memcpy((byte*)&inputState, (byte*)&realtimeInputState, sizeof(InputState));//copy from realtime to sync
  memcpy((byte*)&outputState, (byte*)&realtimeOutputState, sizeof(OutputState));
  exitCriticalSection();
}
void onTimerFlagTask(void *pvParameters){
  volatile bool tempFlag;
  while(true){
    portENTER_CRITICAL_ISR(&timerMux);
    tempFlag = timerFlag;
    portEXIT_CRITICAL_ISR(&timerMux);
    if(tempFlag){
      portENTER_CRITICAL_ISR(&timerMux);
      timerFlag = false;
      tempFlag = timerFlag;
      portEXIT_CRITICAL_ISR(&timerMux);
      onTimerFlag();
    }
  }
}
void enterCriticalSection(){
  if(xSemaphoreTake(OSSemaphore, 100) != pdTRUE){
    Serial.println("Taking OSSemaphore failed");
  }
  //portENTER_CRITICAL_ISR(&timerMux);
}
void exitCriticalSection(){
  //portEXIT_CRITICAL_ISR(&timerMux);
  xSemaphoreGive(OSSemaphore);
}
void waitForRealtimeFunctionFinished(){
  
}
#if (USE_WIFI || USE_MQTT) == 1
void WiFiEvent(WiFiEvent_t event){
    switch(event) {
      case SYSTEM_EVENT_STA_GOT_IP:
          //When connected set 
          //should initialize mqtt and udp here
          #if DEBUG_MODE == 1
            Serial.println("Wifi is connected.");
          #endif
          #if USE_MQTT == 1
          if(!mqtt.connected()){
            if(mqtt.connect(eepromConfig.getMqttClientName(), eepromConfig.getMqttUsername(), eepromConfig.getMqttPassword())){
              #if DEBUG_MODE == 1
                Serial.println("MQTT is connected.");
              #endif
              mqtt.subscribe(eepromConfig.getMqttRxTopic());
              //mqtt.publish(eepromConfig.getMqttTxTopic(), "Hello.");
              //mqtt.subscribe(eepromConfig.getMqttRxTopic());
              if(rebootViaMqtt){
                rebootViaMqtt = false;
                mqtt.publish(eepromConfig.getMqttTxTopic(), "Rebooted.", true);
              }else{
                mqtt.publish(eepromConfig.getMqttTxTopic(), "Hello.");
              }
              
            }else{
              #if DEBUG_MODE == 1
                Serial.println("Cannot connect to MQTT server.");
              #endif
            }
          }
          #endif
          break;
      case SYSTEM_EVENT_STA_DISCONNECTED:
          break;
    }
}
#endif
void Esp32OSInitialize(){
  #if DEBUG_MODE == 1
  Serial.begin(DEFAULT_BAUDRATE_FOR_DEBUG_MODE);
  #endif
  //set touch threshold
  for(int i = 0; i<4; i++){
    buttonFilter[i].hysteresisLength = BUTTON_HYSTERESIS_US/SAMPLING_TIME_US;
  }
  for(int i = 0; i<3; i++){
    curtainFilter[i].hysteresisLength = CURTAIN_HYSTERESIS_US/SAMPLING_TIME_US;
  }
  eepromConfig.init();
  #if DEBUG_MODE == 1
  Serial.println("EEPROM init finished.");
  eepromConfig.reportAllParameter(&Serial);
  #endif
  OSSemaphore = xSemaphoreCreateMutex();
  xTaskCreatePinnedToCore(onTimerFlagTask, "onTimerFlagTask", 1024, NULL, 1, NULL, 1);
  timer = timerBegin(0, 80, true);
  timerAttachInterrupt(timer, &onTimer, true);
  timerAlarmWrite(timer, SAMPLING_TIME_US, true);
  setupSignalPattern();
  #if DEBUG_MODE == 1
  Serial.println("Signal pattern setup finished.");
  #endif
  for(int i = 0; i<4; i++){
    strainGaugeFilter[i].setTimeConstant(eepromConfig.getStrainGaugeLowPassFilterTimeConstant(), eepromConfig.getStrainGaugeHighPassFilterTimeConstant());
  }
  #if DEBUG_MODE == 1
  Serial.println("Set strain gauge filter... finished");
  #endif
  
  #if USE_WIFI == 1
  WiFi.disconnect(true);
  WiFi.onEvent(WiFiEvent);
  #if DEBUG_MODE == 1
  Serial.println("WIFI Event linked");
  #endif
  WiFi.begin(eepromConfig.getWifiSSID(), eepromConfig.getWifiPassword());
  #if DEBUG_MODE == 1
  Serial.println("WIFI begin() called.");
  Serial.print("SSID: ");
  Serial.println(eepromConfig.getWifiSSID());
  Serial.print("Password: ");
  Serial.println(eepromConfig.getWifiPassword());
  #endif
  #endif
  #if DEBUG_MODE == 0
  Serial.begin(eepromConfig.getBaudrate());
  #endif
  #if USE_MQTT == 1
  mqtt.setServer(eepromConfig.getMqttServerName(), eepromConfig.getMqttServerPort());
  mqtt.setCallback(mqttCallback);
  mqttWifiSerial.onFlush = onMqttWifiFlush;
  #endif
  switch(rebootSource){
    case 0://Serial
      Serial.println("Rebooted.");
      break;
    case 1://mqtt
      rebootViaMqtt = true;
      break;
  }
  rebootSource = -1;
  delay(1000);
  lowLevelInitialize();
  #if DEBUG_MODE == 1
  Serial.println("LowLevelInitialize() finished.");
  #endif
  timerAlarmEnable(timer);
  #if DEBUG_MODE == 1
  Serial.println("Timer start");
  #endif
  
}
void Esp32OSRun(){
  //copy to runtime
  enterCriticalSection();
  memcpy((byte*)&runtimeInputState, (byte*)&inputState, sizeof(InputState));
  memcpy((byte*)&runtimeOutputState, (byte*)&outputState, sizeof(OutputState));
  exitCriticalSection();
  byte tempC;
  while(Serial.available()){
    tempC = Serial.read();
    #if DEBUG_MODE == 1
    
    Serial.print(tempC);
    
    #endif
    serialRMC.insertToString(tempC);
    if(tempC == 10){
      #if DEBUG_MODE == 1
      Serial.println("Auto Insert Null");
      #endif
      serialRMC.insertToString((char) 0);
      #if DEBUG_MODE == 1
      Serial.println("Auto Insert Null");
      #endif
      runCommand(&serialRMC);
      #if DEBUG_MODE == 1
      Serial.println("Command Ran");
      #endif
    }else if(tempC == 0){
      #if DEBUG_MODE == 1
      Serial.println("Null received");
      #endif
      runCommand(&serialRMC);
      #if DEBUG_MODE == 1
      Serial.println("Command Ran");
      #endif
    }
    
  }
  #if USE_MQTT == 1
  mqtt.loop();
  while(mqttWifiSerial.available()){
    if(mqttWifiRMC.insertToString(mqttWifiSerial.read()))
      runCommand(&mqttWifiRMC);
  }
  #endif
  
  
  while(runtimeInputState.buttonGestureTimerCounterFlag > 0){
    runtimeInputState.buttonGestureTimerCounterFlag--;
    enterCriticalSection();
    if(inputState.buttonGestureTimerCounterFlag > 0)//make sure that this is not go down below 0
      inputState.buttonGestureTimerCounterFlag--;
    exitCriticalSection();
    onButtonEvent(runtimeInputState.currentGesture, false);
  }
  while(runtimeInputState.buttonGestureAutoTriggerCounterFlag > 0){
    runtimeInputState.buttonGestureAutoTriggerCounterFlag--;
    enterCriticalSection();
    if(inputState.buttonGestureAutoTriggerCounterFlag > 0)//make sure that this is not go down below 0
      inputState.buttonGestureAutoTriggerCounterFlag--;
    exitCriticalSection();
    onButtonEvent(runtimeInputState.currentGesture, true);
  }
  for(int i = 0; i<3; i++){//check Curtain Flag
    if(runtimeInputState.curtainRiseFlag[i]){
      enterCriticalSection();
      runtimeInputState.curtainRiseFlag[i] = false;
      inputState.curtainRiseFlag[i] = false;
      exitCriticalSection();
      onCurtainChange(i, 1, (runtimeInputState.realtimeCountsOfLastCurtainEvent[i]*SAMPLING_TIME_US)/1000);//rising
    }
    if(runtimeInputState.curtainFallFlag[i]){
      enterCriticalSection();
      runtimeInputState.curtainFallFlag[i] = false;
      inputState.curtainFallFlag[i] = false;
      exitCriticalSection();
      onCurtainChange(i, 0, (runtimeInputState.realtimeCountsOfLastCurtainEvent[i]*SAMPLING_TIME_US)/1000);//Falling
    }
  }
  if(runtimeInputState.strainGaugeReadFlag){
    enterCriticalSection();
    runtimeInputState.strainGaugeReadFlag = false;
    inputState.strainGaugeReadFlag = false;
    exitCriticalSection();
    onStrainGaugeRead();
  }
  mainLoop();
  for(auto cdtIt = cdtVector.begin(); cdtIt != cdtVector.end(); cdtIt++){
    (*cdtIt)->onRuntime();
  }
  updateOutputState();

